export default [
  {
    "description": `Призначений для підсилення вихідного струму блоків керування в
                яких вихід керування двигуном не може забезпечити достатнього
                струму. Наприклад, якщо вихід блока керування забезпечує струм
                10-15А, а двигун(насос) споживає 30А і більше. Тестувався з блоком
                керування Raven RCM. Пристрій має систему захисту двигуна по струму. В разі наприклад
                підклинювання двигуна,його робочій струм зростає і система захисту
                спрацьовує. Якщо спрацювала система захисту,загораеться червоний
                світлодиод і живлення на двигун припиняється. Вхід сигналу
                керування регулятором розв'язан від блока керування, тим самим
                забезпечується захист блока у разі виходу регулятора з ладу. Зняти
                захист можна тільки відключивши та знов включивши пристрій при
                умові, що перевантаження на виході також усунуто.`,
    "id": "7567ec4b-b10c-48c5-9345-fc73c48a80aa",
    "title": "Підсилювач струму",
    "img_src": "product_01.png"
  },
  {
    "description": `Цей девайс має 14 фіксованих кольорів та режим плавної зміни
                 кольору. Розмір платі 30мм, що дозволяє встановити її будь-де(за
                 монітор,телевізор,у нічник,стелю тощо.) Красиві кольори і
                 відтінки, нададуть ще більш барвистий вигляд у вашій спальні,
                 кухні або дитячій.`,
    "id": "7567ec4b-b10c-48c5-9345-fc73c48a80aa",
    "title": "Плата RGB LED світильника",
    "img_src": "product_02.png"
  },
  {
    "description": `Призначений для керування обертами двигунів різного роду
                призначення. Зокрема підходить для водяних мембранних насосів
                високого тиску та насосів для перекачування рідинних
                добрив(карбамідно-аміачна сумішей (КАС),аммиака). Завдяки цьому
                регулятору, Ви зможете контролювати швидкість перекачування рідини
                обо сипких речовин. Даний регулятор має вихід на кінцевик для
                дистанційного вимикання двигуна.`,
    "id": "7567ec4b-b10c-48c5-9345-fc73c48a80aa",
    "title": "Регулятор обертів двигуна постійного струму",
    "img_src": "product_03.png"
  },
  {
    "description": `Призначений для діагностування несправностей та ремонту
                авто/мото/сільгосп техніки. Режим вимірювання дозволяє міряти
                напругу до 30 Вольт постійного струму. Режим прозвонки призначений
                для пошуку обриву проводки. Режими 300R та 1K призначені для
                пошуку контактів центрального замку. На центральний вивід тестера
                підключеється резистор опором 300 ом або 1 кілоОм. Стане у нагоді
                при встановленні сигналізації. Даний прилад стане надійним
                помічником при діагностуванні та ремонті проводки. Завдяки
                маленьким розмірам, не займає багато місця на робочому столі. При
                бажанні,можно носити його навіть у кишені. Тестер працює від
                акумулятора та підзаряджається від будь-якого блоку живлення з
                напругою 5 Вольт через роз'єм microusb.`,
    "id": "7567ec4b-b10c-48c5-9345-fc73c48a80aa",
    "title": "Мінівольтметр автоелектрика",
    "img_src": "product_04.png"
  }
]