<template>
  <section class="our-products">
    <div class="products">
      <h1 class="products-title">Замовлення наших клієнтів</h1>

      <ul class="product-list">
        <!-- <li class="product-element">
          <div class="product-img-container">
            <img src="../assets/img/product_01.png" alt="product" />
          </div>
          <div class="about-product">
            <a href="#" class="product-name">Підсилювач струму(бустер)</a>
            <ul class="product-features">
              <li>Бустер має три свитлодіода:</li>
              <li>Зелений-индикатор живлення 12В.</li>
              <li>Синій-индикатор вхідного сигналу..</li>
              <li>Червоний-индикатор спрацювання захисту.</li>
            </ul>
            <ul class="product-features">
              <li>
                Герметично залитий корпус з кріпленням дозволяє встановлювати
                цей регулятор на відкритому повітрі.
              </li>
              <li>Кабелі для підключення 6 кв. мм.</li>
              <li>Запобіжник на 50А.</li>
              <li>Робоча напруга 12 Вольт.</li>
              <li>Робочій струм 40 Ампер.</li>
              <li>Струм спрацювання захисту 50 Ампер.</li>
            </ul>
            <p class="product-desc">
              Призначений для підсилення вихідного струму блоків керування в
              яких вихід керування двигуном не може забезпечити достатнього
              струму. Наприклад, якщо вихід блока керування забезпечує струм
              10-15А, а двигун(насос) споживає 30А і більше. Тестувався з блоком
              керування Raven RCM.
              <br />
              <br />
              Пристрій має систему захисту двигуна по струму. В разі наприклад
              підклинювання двигуна,його робочій струм зростає і система захисту
              спрацьовує. Якщо спрацювала система захисту,загораеться червоний
              світлодиод і живлення на двигун припиняється. Вхід сигналу
              керування регулятором розв'язан від блока керування, тим самим
              забезпечується захист блока у разі виходу регулятора з ладу. Зняти
              захист можна тільки відключивши та знов включивши пристрій при
              умові, що перевантаження на виході також усунуто.
            </p>
          </div>
        </li>

        <li class="product-element">
          <div class="about-product">
            <a href="#" class="product-name">Плата RGB LED світильника</a>
            <p class="product-desc">
              Цей девайс має 14 фіксованих кольорів та режим плавної зміни
              кольору. Розмір платі 30мм, що дозволяє встановити її будь-де(за
              монітор,телевізор,у нічник,стелю тощо.) Красиві кольори і
              відтінки, нададуть ще більш барвистий вигляд у вашій спальні,
              кухні або дитячій.
              <br />
              <br />
              Живлення відбувається через роз'єм Micro usb від будь-якого
              джерела напругою 5V. Підійде зарядний пристій від мобільного
              телефона.
            </p>
          </div>
          <div class="product-img-container">
            <img src="../assets/img/product_02.png" alt="product" />
          </div>
        </li>

        <li class="product-element">
          <div class="product-img-container">
            <img src="../assets/img/product_03.png" alt="product" />
          </div>
          <div class="about-product">
            <a href="#" class="product-name"
              >Регулятор обертів двигуна постійного струму</a
            >
            <ul class="product-features">
              <li>Надійний металевий корпус з кріпленням.</li>
              <li>Кабелі для підключення 6 кв. мм.</li>
              <li>Запобіжник на 40А.</li>
              <li>Робоча напруга 12 Вольт</li>
              <li>Робочій струм 40 Ампер.</li>
              <li>Максимальний струм 45 Ампер.</li>
            </ul>
            <p class="product-desc">
              Призначений для керування обертами двигунів різного роду
              призначення. Зокрема підходить для водяних мембранних насосів
              високого тиску та насосів для перекачування рідинних
              добрив(карбамідно-аміачна сумішей (КАС),аммиака). Завдяки цьому
              регулятору, Ви зможете контролювати швидкість перекачування рідини
              обо сипких речовин. Даний регулятор має вихід на кінцевик для
              дистанційного вимикання двигуна.
            </p>
          </div>
        </li>

        <li class="product-element">
          <div class="about-product">
            <a href="#" class="product-name">Мінівольтметр автоелектрика</a>
            <p class="product-desc">
              Призначений для діагностування несправностей та ремонту
              авто/мото/сільгосп техніки. Режим вимірювання дозволяє міряти
              напругу до 30 Вольт постійного струму. Режим прозвонки призначений
              для пошуку обриву проводки. Режими 300R та 1K призначені для
              пошуку контактів центрального замку. На центральний вивід тестера
              підключеється резистор опором 300 ом або 1 кілоОм. Стане у нагоді
              при встановленні сигналізації. Даний прилад стане надійним
              помічником при діагностуванні та ремонті проводки. Завдяки
              маленьким розмірам, не займає багато місця на робочому столі. При
              бажанні,можно носити його навіть у кишені. Тестер працює від
              акумулятора та підзаряджається від будь-якого блоку живлення з
              напругою 5 Вольт через роз'єм microusb.
            </p>
          </div>
          <div class="product-img-container">
            <img src="../assets/img/product_04.png" alt="product" />
            <img src="../assets/img/product_04_01.png" alt="product" />
          </div>
        </li> -->
        <!-- <li
          class="product-element"
          v-for="product in products"
          :key="product.title"
        >
          <div class="product-img-container">
            <img
              :src="require(`../assets/img/${product.img_src}`)"
              alt="product"
            />
          </div>

          <div class="about-product">
            <a href="#" class="product-name">{{ product.title }}</a>
            <p class="product-desc">
              {{ product.desc }}
            </p>
          </div>
        </li> -->
        <li
          class="product-element"
          v-for="product in products"
          :key="product.id"
        >
          <div class="product-img-container">
            <img
              src="../assets/img/product_02.png"
              alt="product"
            />
          </div>

          <div class="about-product">
            <a href="#" class="product-name">{{ product.title }}</a>
            <p class="product-desc">
              {{ product.description }}
            </p>
          </div>
        </li>
      </ul>
      <Hexagon />
    </div>
  </section>
</template>

<script lang="ts">
import Hexagon from "@/components/Hexagon.vue";

// const  productList = require ('./productList.json');

import { Product } from "@/models/product";
import { productApi } from "@/api/product-api";

export default {
  name: "Products",
  components: {
    Hexagon,
  },
  props: {
    msg: String,
  },
  // data: function () {
  //   return {
  //     products: [
  //       {
  //         index: 1,
  //         img_src: "product_01.png",
  //         title: "Підсилювач струму",
  //         desc: `Призначений для підсилення вихідного струму блоків керування в
  //             яких вихід керування двигуном не може забезпечити достатнього
  //             струму. Наприклад, якщо вихід блока керування забезпечує струм
  //             10-15А, а двигун(насос) споживає 30А і більше. Тестувався з блоком
  //             керування Raven RCM. Пристрій має систему захисту двигуна по струму. В разі наприклад
  //             підклинювання двигуна,його робочій струм зростає і система захисту
  //             спрацьовує. Якщо спрацювала система захисту,загораеться червоний
  //             світлодиод і живлення на двигун припиняється. Вхід сигналу
  //             керування регулятором розв'язан від блока керування, тим самим
  //             забезпечується захист блока у разі виходу регулятора з ладу. Зняти
  //             захист можна тільки відключивши та знов включивши пристрій при
  //             умові, що перевантаження на виході також усунуто.`,
  //       },
  //       {
  //         index: 2,
  //         img_src: "product_02.png",
  //         title: "Плата RGB LED світильника",
  //         desc: `Цей девайс має 14 фіксованих кольорів та режим плавної зміни
  //             кольору. Розмір платі 30мм, що дозволяє встановити її будь-де(за
  //             монітор,телевізор,у нічник,стелю тощо.) Красиві кольори і
  //             відтінки, нададуть ще більш барвистий вигляд у вашій спальні,
  //             кухні або дитячій.`,
  //       },
  //       {
  //         index: 3,
  //         img_src: "product_03.png",
  //         title: "Регулятор обертів двигуна постійного струму",
  //         desc: `Призначений для керування обертами двигунів різного роду
  //             призначення. Зокрема підходить для водяних мембранних насосів
  //             високого тиску та насосів для перекачування рідинних
  //             добрив(карбамідно-аміачна сумішей (КАС),аммиака). Завдяки цьому
  //             регулятору, Ви зможете контролювати швидкість перекачування рідини
  //             обо сипких речовин. Даний регулятор має вихід на кінцевик для
  //             дистанційного вимикання двигуна.`,
  //       },
  //       {
  //         index: 4,
  //         img_src: "product_04_01.png",
  //         title: "Мінівольтметр автоелектрика",
  //         desc: `Призначений для діагностування несправностей та ремонту
  //             авто/мото/сільгосп техніки. Режим вимірювання дозволяє міряти
  //             напругу до 30 Вольт постійного струму. Режим прозвонки призначений
  //             для пошуку обриву проводки. Режими 300R та 1K призначені для
  //             пошуку контактів центрального замку. На центральний вивід тестера
  //             підключеється резистор опором 300 ом або 1 кілоОм. Стане у нагоді
  //             при встановленні сигналізації. Даний прилад стане надійним
  //             помічником при діагностуванні та ремонті проводки. Завдяки
  //             маленьким розмірам, не займає багато місця на робочому столі. При
  //             бажанні,можно носити його навіть у кишені. Тестер працює від
  //             акумулятора та підзаряджається від будь-якого блоку живлення з
  //             напругою 5 Вольт через роз'єм microusb.`,
  //       },
  //     ],
  //   };
  // },

  created() {
    this.fetchProducts();
  },
  methods: {
    fetchProducts() {
      this.isFetching = true;

      productApi
        .fetchAvailableProducts()
        .then((products) => {
          this.products = products;
        })
        .finally(() => {
          this.isFetching = false;
        });
    },
  },
};
</script>

<style scoped lang="scss">
@import "../styles/variables.scss";
@import "../styles/products.scss";
</style>